Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 羿清皱了皱眉，看了两人一眼道，“之前我们都猜错了，曲双城的魔界之门，只是一个晃子。真正的魔界之门早已经转移了，不在任何一个地方，而是一直在宁子安身上，他本身就是界门。”
en_us: Yi Qing furrowed his brows, glanced the two, and said, “All our previous guessings were wrong. The Door of Demon Realm at Qushuang City was just a pretense. The real Door of Demon Realm has been shifted to somewhere not at any particular place, but on Ning ZiAn! He, is the Realm Gate! "

source: 羿清皱了皱眉，细一回想，当时宁子安元灵剑气暴发，薄仪分神。那魔族趁机遁走，然后……
en_us: Yi Qing furrowed his eyebrows in deep thought. At that time... NingZiAn's inner sword spirit erupted, which caused Pu Yi to be distracted. The demonic beast took the chance to escape, and then...

source: 羿清盘腿坐下，调息了一会才一咬牙道，“你们在这等着，我一人上去！”
en_us: Yi Qing seated himself down in a lotus position. After taking a moment to regulate his meridians, he gritted his teeth and said, "You all wait here. I'm going up!"

source: 羿清直接就冲入那片荆棘之中，剑招变幻，顿时只见万千剑光在一片绿色的荆棘中游走，仿佛活过来一般。不到片刻的工夫，原本密密麻麻的藤蔓全被切成了小段，掉落下来。
en_us: Yi Qing immediately rushed towards the field of thistles with his sword. The sword shone as it weaved through the thistles as if it were alive. Within a moment, the thick forest of thistles was sliced into small bits and fell to the ground.

source: 羿清直接把右手上的幡旗横在手里，沉声道，“我来此，是想将此幡交予贵派。想请贵派以清灵之气化解幡上的鬼气，超渡里面的数万怨魂。”
en_us: Yi Qing immediately placed the flag which he had been holding in his right hand on his other palm, saying, "I'm here to give this to you. I would like to ask you to use your sect's Spirit Cleansing Qi to rid the Ghost Qi in the flag and release the thousands of vengeful spirits from the gonfalon."

source: 羿清眉头一下皱了起来，“不行，我不能让人误会师父。”
en_us: Yi Qing furrowed his brows and said, "No, I cannot let people misunderstand my master."

source: 羿清眉头拧了又松，似是十分的纠结，脸上表情几度变换，犹豫，担忧，崇拜，期待等等情绪，一一闪过。半会才一咬牙，像是终于鼓足了勇气一般，扑通一声跪了下去，恭敬的朝着她一拜，“请前辈，收我为徒！”
en_us: Yi Qing furrowed and relaxed his brows in turn, seeming to be very conflicted. His expression kept changing from being hesitant, to worried, then showing adoration followed by anticipation and so on. After a while, he seemed to have finally mustered up courage and dropped down onto his knees, respectfully giving a bow, "Senior, please accept me as your disciple!"

source: 羿清眉头拧得更紧了，细一下看对方的修为，心底顿时有了一番猜测，心头却更加堵得慌。
en_us: Yi Qing frowned deeply and studied the two people's cultivations. He suddenly understood something and his heart fell even further as he began to feel nervous.

source: 羿清眉头紧了紧，看了沈萤一眼，出声提醒道，“让萝卜带路吧！”
en_us: Yi Qing furrowed his brows, looked at Shen Ying and reminded, "Let the radish lead the way!"

source: 羿清眉头紧收，握紧手中的剑，看向五人道，“你们……是跟郁海珩一起消失的游仙！”
en_us: Yi Qing raised his eyebrows and tightened his grip around his sword. He stared at the five poeple, "You... are the traveling immortas who disappeared together with Yu Hai Heng!"

source: 羿清眉头紧皱，他太大意了，幡虽然已经被封印，但仍会有鬼气溢出。原本以为带在身上，以他的灵气刚好可以制住幡上的鬼气，以免祸及他人。但他却忘了，就算是再弱小的鬼气，普通修士感觉不到，魔修却一眼能看出来。
en_us: Yi Qing furrowed his brows; he had been too careless. Although the gonfalon was already sealed, its Ghost Qi would seep out and dissipate. He had thought that his Spirit Qi could contain the Ghost Qi in the gonfalon which was why he brought it along with him, so that it would not cause harm to others. However, he forgot that even the tiniest amount of Ghost Qi could be easily spotted by a fiendish cultivator even if a normal cultivator could not sense anything.

source: 羿清神色一沉，剑招一收，直接放弃了防御，调动全身所有的灵气，凝聚成一把直达天际的金色巨剑。
en_us: Yi Qing's expression darkened. He recalled his swords, collapsing the defensive wall. Yi Qing channelled all his Spirit Qi into forming a Great Golden Sword which extended to the end of the horizon.

source: 羿清神色顿时一变，一脸坚定的道，“那绝对是魔界之门！没错！”
en_us: Yi Qing's face instantly changed, and with a determined look, he confirmed, "That definitely is the door of the Demon Realm. It must be!"

source: 羿清突然插了句道，“师父的意思是说，上次外事堂通知新进一批弟子全已成功僻谷，所以那里已经没有食材可领了。”师父总不能饿肚子的。
en_us: Yi Qing suddenly interrupted, "Master actually meant that the Outer Affairs Hall had informed us that the new batch of disciples have all achieved grain liberation, so there were no more ingredients to be collected anymore." Master cannot be left in hunger.

source: 羿清立马把她手里的旗帜接了过去，从储物袋里掏出一把木椅道：“师父要不坐下休息会。”
en_us: Yi Qing took the flag from her hands immediately. He then reached into his storage bag and retrieved a wooden stool. "Master, why don't you sit down and take a break?"

source: 羿清立马站了起来，一脸兴奋的捏了个诀，习惯性的带着沈萤御剑而起。直接朝着峰外飞了出去。
en_us: Yi Qing stood up immediately, his face lit with excitement as he produced a hand seal before habitually bringing Shen Ying along on his sword and flew out of the peak.

source: 羿清立马调转灵剑，朝着下方一处空地飞了下去，先是捏了个风系法术扫出一片干净的区域。
en_us: Yi Qing adjusted his sword and headed toward the ground. He cast a wind-elemental Dharma spell to sweep the area clean before he landed.

source: 羿清立马跟了上去，顺手拣起地上一个铃铛递给陆修士。
en_us: Yi Qing immediately followed behind, at the same time picking up a bell from the ground which he handed to Cultivator Lu.

source: 羿清第四次醒来的时候，没错，他还在地上。此时他全身的经脉已经修复，只是体内妖气未清，不能动用灵力。而那个救他的灰衣姑娘，还……还在挖坑。
en_us: Yi Qing later awoke for the fourth time. And yes, he was still lying on the ground. At this point, the meridians in his entire body had rejuvenated; only, he could not activate his Spiritual Power as his body had not rid itself completely of the demonic aura. As for that girl in grey, she was still…still at work digging the pit.

source: 羿清细一感应，才发现修为已经涨到了化神后期。心下一喜，第一反应就是出洞往后殿而去，远远就看到了沈萤。
en_us: Yi Qing sensed his own body strength and realised he was already in the late stages of Soul Formation. He rejoiced in his heart and exited the cave, heading for the rear hall. He spotted Shen Ying from afar.

source: 羿清脸上又青了青，低声道，“我忘了储物袋在跟芮糜打斗时丢了，师父……可有带灵珠？”
en_us: Yi Qing's face turned green, lowered his volume and asked, "I forgot that my storage bag was lost during the battle with Rui Mi. Master… do you have any spiritual pearls with you?"

source: 羿清脸色一沉，瞬间也想到了这一点，扫了所有被控制的人一眼，一边挡住对方的攻击，一边沉声道，“集中注意力，先唤醒三位家主！”
en_us: Yi Qing's expression fell as he suddenly realised this as well. He scanned the group of manipulated bodies as he defended against their attacks. Then, he replied, "Focus! Wake the three family masters up first!"

source: 羿清脸色也沉了沉，“郁家是四大世家中，最古老的一个，莫非他们真有什么别人不知道的秘法，能从师父眼前逃走？”
en_us: Yi Qing's expression darkened, "The Yu Family is the oldest out of all four aristocratic families. Could it be that they really practise mystic arts that people don't know about so that they can escape right before Master's eyes?"

source: 羿清脸色更冷了，偏偏他还真没理由阻止他，看了看前方已经陆续来齐的众弟子，大声道，“出发！”转身唤出灵剑，朝着沈萤伸出手，“师父，我们走吧！”说完也不理旁边的某人，带着人嗖的一声，先一步飞出去了。
en_us: Yi Qing's expression turned even colder, but he really had no grounds to stop him. He looked at the disciples who had gathered in front and in a loud voice, commanded, "Depart!" Turning around, he summoned his sword and reached his hand out to Shen Ying. "Master, let us go!" Completely ignoring a certain someone next to him, Yi Qing immediately took off with Shen Ying.

source: 羿清虽然不练丹，却对练器颇有研究，这异火强横用来练器，再好不过。
en_us: Yi Qing did not know how to refine pills, but he had quite a bit of knowledge on weapon refinement. The Deviant Fire would be especially useful for refining weapons.

source: 羿清试着动了一下，发现疼痛消失了，体内的灵气也开始运转，正在自发的修复着筋脉。
en_us: Yi Qing tried to move and realized that the pain had disappeared. The Spirit Qi in his body had also begun to regulate itself and heal the meridians on its own.

source: 羿清走上扇面，习惯性的拉开了身侧的储物袋，变戏法似的从里面掏出了，桂花糕，莲花饼，缕子脍，金乳酥，小天酥……
en_us: Yi Qing walked onto the fan, habitually opened the storage pouch by his side, and as if by magic, he dug out chrysanthemum cakes, lotus flower biscuits, fish slices, golden milk cakes, small day cakes…

source: 羿清越听眼睛睁得越大，没想到沈姑娘竟然……不，沈前辈居然是如此厉害的人物吗？他突然想起，自己重伤掉到这里的那晚，芮糜被啪啪啪砸得满地开花的场景。原本他以为自己眼花出现了幻觉，没想到那是真的吗？
en_us: The more Yi Qing listened, the wider his eyes became. Little did he expect Lady Shen to be… No, Senior Shen was actually such a formidable character? He suddenly thought of the night when he was heavily wounded and fell here; Rui Mi was beaten up so badly all over. Initially, he had thought that his eyes were playing tricks on him, but that was actually all real?

source: 羿清越说越觉得有必要，更加的坚定，“师父尽管去休息，我不会打扰您睡觉的。”
en_us: The more Yi Qing spoke, the more he felt the need to stand guard. He held a firm stance as he said, "Master, go ahead and rest. I will not disturb your sleep."

source: 羿清跟了过来，心底又是一阵激荡，连万年冰参，千年绿灵，都可以视做普通萝卜对待，果然是隐世的高人。
en_us: Yi Qing followed behind her with an array of thoughts surging in his mind. Even a ten thousand-year-old Ice Ginseng and thousand-year-old Green Spirit were treated just like normal carrots — she was indeed a hidden expert.

source: 羿清跟几人交待了一下细节，不到半刻钟，就隐隐感觉到了众多游仙的威压，直往这边而来。
en_us: Yi Qing walked through the plan with the others. A short while later, he could faintly detect the menacing aura of many traveling immortals heading straight towards them.

source: 羿清跟青亦已经战到一块了，满天都是密不透风的剑光，他们一个带着疯狂，一个豁出了命。全都是拼尽了全力出招，本就是高阶修士的对决，不到半会不单是储丹室，整仙宫都开始摇摇欲坠起来。
en_us: Yi Qing and Qing Yi had already been fighting for awhile. The air was filled brilliant gleams of light from the sword. One was fighting crazily and the other was fighting for his life. Both were giving all they had to overpower the other. This duel between two high-level cultivators caused not just the Pill Storage Repository, but the entire Immortal Pavilion to quake.

source: 羿清蹭的一下站了起来，转身高兴的出了院子，那轻快的样子，仿佛中了头奖似的，转瞬就消失在门口。
en_us: Yi Qing stood up immediately and left the yard in joy. That briskness in his steps were as if he had won a top prize as he turned and disappeared by the door.

source: 羿清身上一松，之前那种巨大的束缚感消失了，就连着灵气的流失也停了下来，刚一起身，却看到地上的狐妖化成了一团红雾，想要遁走。
en_us: Yi Qing immediately relaxed. The previous sensation of constraint had disappeared, and even the loss of Spirit Qi had ceased. But just when he stood up, the fox demon on the ground transformed into a cloud of red smoke, trying to flee.

source: 羿清转身朝着追上来的众游仙，挥出一剑，顿时满天剑气铺天盖地而去，“人醒了，走！”他沉声交代了一句，转身就飞向远处。
en_us: Yi Qing turned around and thrust his sword toward the Traveling Immortals who were chasing him. The sky filled with Sword Qi. "They're awake! Go!" Yi Qing instructed. Then, he changed directions and flew toward the horizon.

source: 羿清转过头，脸上可惜的表情一闪而失，这才走了过去，一脸认真的道，“若不如此，唤不醒你！”
en_us: Yi Qing turned away, a look of pity flashing across his face. He walked toward Lonemoon slowly and said, "If I didn't do that, you wouldn't have regained consciousness!"

source: 羿清这场绝地反杀，只花了半刻钟不到的时间，就解决了那个青亦。他压制的修为也已经到达了极限，兴许是因为这处仙宫中的灵气太过浓郁。羿清这场顿悟只花了不到两个时辰就结束了。修为直接从元婴升上了化神，瞬间赶上了孤月的修为。
en_us: Yi Qing was out to kill this time. He took less than a minute to finish off Qing Yi. He could suppress his cultivation level no longer — the Spirit Qi in this Immortal Pavilion was far too thick. Yi Qing's epiphany lasted only two hours, yet in this short timeframe he had advanced to the Soul Formation stage. He had caught up with Lonemoon just like that.

source: 羿清这套剑法整整演示了有大半个时辰，招式千变万化，威力极大。虽然他已经尽量收敛剑气，待收势时还是让整个岛被削掉了一节高。
en_us: Yi Qing demonstrated this set of sword techniques for almost an hour. His moves were ever-changing and powerful. Although he had tried his best to rein in the power of his Sword Qi, the entire upper section of the island was chopped off by him by the time he finally withdrew his Qi.

source: 羿清这才把手上的人放下，正是薄家父子。他们似是受了什么打击似的，一脸不敢置信，特别是薄仪似乎还受了重伤。
en_us: before Yi Qing put the Bo father and son, who were in his arms down. They seem to be taken aback by whatever just happened, especially the injured Pu Yi, with their faces of disbelief.

source: 羿清这才躺了回去，眼睛却一直看着她，“我已无大碍，多谢师父为我疗伤。”
en_us: Yi Qing lay back down, but his eyes kept looking at her. "I'm all right. Thank you Master for nursing my injuries."

source: 羿清这才转头扫向厨房的众人，一时间仿佛一阵寒气横扫而止，使得整个院子温度都冷好几十度。
en_us: Yi Qing merely turned to glance at all the people in the kitchen, yet that look alone was enough to make them feel as if a cold draught had enveloped the area, causing the whole yard's temperature to be lowered by dozens of degrees.

source: 羿清这才转身拿起灵剑道，“师父，我现在修行的剑法，名为：荡天诀，乃是我自创的一套剑法，还请师父指教！”
en_us: Yi Qing then turned around and took his spiritual sword and said, "Master, the sword technique that I am cultivating now is called the Dang Tian tactic. It is a sword dharma that I invented. Master, please provide me with your guidance!"

source: 羿清都懵了，突然明白修房子那天，兔王紧张兮兮拉着他说的那句话了，“千千万别吵她睡觉！不然后果很严重。”现在他知道了，嗯……真的很严重。
en_us: Yi Qing was confused. Suddenly he understood what the Rabbit Monarch had meant that day. When they were repairing the house, it had nervously pulled him over to whisper, "Never disturb her sleep! Otherwise, the consequences will be very serious." Now he knew, uh… It was serious alright.

source: 羿清闭上眼，一次对付八位游仙，的确耗尽了他的全力。继续调息了半个时辰，才睁开眼睛。拿起旁边染血的长剑，这才一步步往最后一层走去。
en_us: Yi Qing closed his eyes. Dealing with eight traveling immortals at once definitely wore him down. After an hour, he re-opened his eyes. He picked up the blood-covered sword next to him and ascended to the third level.

source: 羿清闻声，手里的剑一转，那庞大的剑意这才一偏，轰隆一声打在了旁边的山上，顿时把那座山峰削掉了一节，一时间满山遍野的乱石滚落。
en_us: Yi Qing twisted his hand and the sword intent deflected with a sharp noise, crashing into the mountain beside Lonemoon. The top of the mountain was shaved off by the Great Golden Sword and rocks began to roll down.

source: 羿清隐隐觉得心口塞塞，才短短几个月的时间，这是从哪蹦出的小婊砸？！
en_us: Yi Qing felt his heart grow cold. How did this little kid appear in just a few short months?

source: 羿清顺手拉了她一把，助她出来。回头看了看那深坑，下意识的问，“姑娘您这是……”怎么觉得她比上次更加失望了。
en_us: Yi Qing helped to pull her out of the pit. Turning round to look at the deep pit, he subconsciously asked, "Miss, you mean…" He could not help but get the feeling that she was even more disappointed this time.

source: 羿清顿时有些绝望起来，没想到会在此时遇到妖王。莫说他现在灵气未复，就算是他全盛时期，以他金丹的修为，在堪比元婴的妖王面前，也是毫无胜算的。
en_us: Yi Qing immediately felt a sense of helplessness. He had not expected to meet a Demon Monarch at this time. Notwithstanding the fact that he had not recovered his Spirit Qi, even if he were at his peak, with his Golden Core cultivation, there was no way he could have defeated this Demon Monarch, who was as powerful as the Nascent Soul.

source: 羿清：“……”
en_us: Yi Qing: "…"

source: 羿清：“……”不愧是师父。
en_us: Yi Qing: "…" Master is a true master.

source: 羿清：“……”加一。
en_us: Yi Qing: "…" Same here.

source: 羿清：“……”咦？啥意思，为啥只有他一个人听不懂？
en_us: Yi Qing: "…" Huh? What did they mean? Why was he the only one who did not understand?

source: 羿清：“……”师父说得好有道理！
en_us: Yi Qing: "…" What Master says makes so much sense!

source: 羿清：“……”我才是师父的徒弟！
en_us: Yi Qing: "..." I am the rightful disciple of my Master!

source: 羿清：“快中午了，师父我去做饭。”
en_us: Yi Qing: "It's almost noon. Master, I'm going to prepare \lunch."

source: 羿清：咦？难道师父刚刚随口说的办法里，有什么厉害的修行道理？
en_us: Yi Qing: What? Was there a profound Dao principle behind Master's casual comment?

source: 羿清：感觉自己背叛了师门……
en_us: Yi Qing felt as though he had just betrayed his master.

source: 羿清：抢师父的小婊砸。
en_us: Yi Qing: Master-stealing bastard.

source: 翊凌雪一脸正色，扬了扬手中的令牌道：“这是我父亲的令牌，我也没有开玩笑，苍狼……或许你自己都不知道，你有一种很奇特的能力，能帮助武者武技快速大成，我们翊家也正是看重了这一点才招揽你的。你去翊家不用做什么，只是天天和家族子弟对练，辅助他们武技快速大成即可……”
en_us: Yi Lingxue sent him a stern look and waved the command token in her hand, "This is my father's command token, and I was not joking. Lone Wolf... maybe you didn't realize it yet, but you have a very unique capability that can help martial artists attain phenomenal success for their techniques. The Yi Family saw this in you and therefore decided to recruit you. Once you joined our family, you need not do anything else except sparring with the family descendants, helping them to achieve phenomenal success as quick as possible..."

source: 翊凌雪倒是没有勉强，只是让江逸好好考虑一下，之后的每天她照样来找江逸对练，却是没有再提及此事。
en_us: Yi Lingxue did not push any further, only asking Jiang Yi to think it over. Following that day, she still went to Jiang Yi for sparring matches, but not once did she bring up the matter again.

source: 翊凌雪展开攻击之后，江逸身形开始飘逸的在练功房内转圈，无论这翊小姐怎么攻击，都碰不到江逸的一片衣角。每次攻击江逸似乎有预感般，翊凌雪还没出招他就已经开始躲避了，两人元力被封印，攻击速度本就差不了多少，试问翊凌雪如何能攻击到江逸？
en_us: After Yi Lingxue carried out her attacks, Jiang Yi's body figure started gracefully moving about in circles around the Technique Practising Room. No matter how much this Young Mistress Yi tried to strike at him, she could not even touch the corner of Jiang Yi's clothes. Every time she launched an attacked, it seemed as though Jiang Yi had premonitive abilities, being able to avoid and hide before Yi Lingxue released her combat techniques. With both persons' essence forces being sealed off from use, their combat speeds were more or less the same. Dare one ask, how could it be possible for Yi Lingxue to ever manage to hit Jiang Yi?

source: 翊凌雪整理了一下火红的武士袍，叹道：“太可惜了……你要是早些努力修炼，说不定天羽城十大天才其中就有你了。”
en_us: Yi Lingxue straightened her fiery-red martial artist robes, sighing, "It's such a shame... if only you had put in more effort before in cultivating, you might have been one of the top ten geniuses of Skyplume City."

source: 翊凌雪浑身衣袍湿透了，此刻大口大口喘气，微微隆起的胸脯上下起伏，无比诱人。听到江逸的话，她俏脸上露出一抹淡淡红晕，看了一眼江逸笑道：“你很会说话哦，行了！今天打痛快了，明日我再找你，不过……明日你能不能还手？别总是躲避，那样没意思。”
en_us: Yi Lingxue's robes were completely wet. At the moment, she was panting and taking in big mouthfuls of air. With her slightly perky breasts moving up and down as she panted, she appeared incomparably alluring. Upon listening to what Jiang Yi said, a faint reddish blush appeared on her delicate face. Looking at Jiang Yi, she smiled and replied, "You sure know how to speak. very well! Today, I've sparred to my heart's content. I'll come and fine you tomorrow, but... can you at least fight back during our match tomorrow? Don't always simply avoid and try to escape, those tactics don't make the match fun at all."

source: 翊凌雪看到江逸走过来，连忙凑过来压低声音说道：“苍狼，这是我堂妹翊飞儿，这段时间我要闭关，以后就让你就和她对练吧！”
en_us: Upon seeing Jiang Yi, Yi Lingxue wasted no time in going to him and whispering, "Lone Wolf, this is my cousin Yi Fei-er. I'll be in seclusion for some time, so I'll let you spar with her in the meantime!"

source: 翊凌雪被虐了一场，不仅没有半点气馁反而兴奋无比，约定第二日再战后扭着圆滚的翘臀大步离开了，看得其余陪练一阵眼热，明显很羡慕江逸的艳福。
en_us: 大步Having been abused in one match, not only did Yi Lingxue not feel a shred of discouragement; rather, she was unbelievably excited. After promising to return the next day for a rematch, she twitched her round buttocks and walked off at a wide pace. Observing her movements, the other sparring partners were all feeling envious. They were all clearly jealous of Jiang Yi's luck with women.

source: 翊凌雪见江逸沉默不说话有些急了，朝前方走了几步，靠近江逸三尺距离，这才轻咬贝唇说道：“苍狼，你要什么待遇尽管提，我都可以转告我父亲。如果你是别的家族子弟这也不是问题，你可以入赘我们翊家，我有一个堂妹，比我还漂亮……”
en_us: Yi Lingxue became slightly anxious at Jiang Yi's silence. She took a few steps towards him until she was a meter away, lightly biting her lips, "Lone Wolf, feel free to make whatever demands you see fit, I'll convey them to my father. If you are the descendant of another family, it won't be a problem either. You can marry into the Yi Family; I have a cousin who is even more beautiful than I am..."

source: 翊凌雪这次让江逸出手攻击她，江逸没办法动用了武技，结果……翊凌雪很悲剧，江逸每次都能先发制人，轻松击中她，好在江逸每次都是点到即止，否则怕是翊凌雪娇贵的身子要饱受虐待了。
en_us: This time, Yi Lingxue insisted on allowing Jiang Yi to make the first move and attack her. Jiang Yi had no choice but to use his martial arts skills. In the end... it was a sad case for Yi Lingxue. Every single time, Jiang Yi was able to pre-empt her moves and take the initiative to strike first, allowing him to easily strike her. Thankfully for her, every time Jiang Yi did not over-exert his force in his attacks and stopped once he touched her, otherwise Yi Lingxue's elegant and fragile body would have to be subject to much physical abuse.

source: 翊凌雪顿了一下解释起来：“姬家二公子姬长歌，三小姐姬听雨，马家大少马黑旗，江家大少江恨水，江家旁系少爷江如龙，冷家大少冷千军，冷家四小姐冷芊芊，柳家三少柳河，柳家旁系少爷柳战，还有一个杨家大少杨中天。这十人都不满十八岁，实力最低都是铸鼎境七重，被誉为这一代的天羽城十大天才。”
en_us: Yi Lingxue paused for a moment before explaining, "Ji Family Second Young Master Ji Changge and Third Young Mistress Ji Tingyu; Ma Family Great Young Master Ma Heiqi; Jiang Clan Great Young Master Jiang Henshui, and Jiang Rulong from the side branch of the Jiang Clan; Leng Family Great Young Master Leng Qianjun and Fourth Young Mistress Leng Qianqian; Liu Family Third Young Master Liu He, and Liu Zhan from the side branch of the Liu family, and last but not least Yang Family Great Young Master Yang Zhongtian. The ten of them are all below the age of 18, yet their power levels are minimally at the seventh stage of the Cast Tripod Realm, hence they are hailed as Skyplume City's top ten geniuses of our generation."

source: 翊小姐一轮暴雨拳竟砸空了？她精致的小脸上都是错愕，随即恼羞成怒再次施展出漫天的拳影将江逸笼罩进去。
en_us: Had her Thunderstorm Fists actually hit nothing but mere air? Young Mistress Yi's delicate face revealed a look of astonishment, which immediately turned to frustrated embarrassment and subsequent anger, as she once again demonstrated her Vast Sky Fists technique and enveloped Jiang Yi inside her fist silhouettes.

source: 翊小姐抓狂了，快步朝江逸欺身而来，又换了几种武技，追着江逸穷追猛打。但无论她怎么攻击，江逸都能提前躲避开去，步伐轻松，像在自家后院闲庭信步般从容。
en_us: Young Mistress Yi became frantic and, with quick steps, moved closer to Jiang Yi. She tried to use various different martial arts techniques, as she pursued Jiang Yi relentlessly and tried to strike him. However, no matter the method she used to attack, Jiang Yi could avoid the move in advance. His steps were light and gentle, moving unhurriedly as though he were idly strolling in his own backyard.

source: 翊小姐整理了一下衣裳大步走了出去，江逸也跟了出去。坐在了人群中，他四处一扫却没有发现杨管事。索性也不管了，闭关打坐恢复消耗的黑色元力。
en_us: Young Mistress Yi straightened out and tidied up her robes before leaving the room at a wide-stepped pace. Jiang Yi followed behind her out of the room as well. Sitting amongst the crowd of sparring partners, he gave a sweeping glance of the room, but could not spot Manager Yang at all. Simply deciding not to concern himself any further, he decided to sit in silence and meditate to restore the black essence forces he had just consumed.

source: 翊小姐气鼓鼓的走了，此刻她一身武士袍都湿透了，曲线尽露，自然不可能在此多停留，否则就白白便宜了众人了。
en_us: Young Mistress Yi stormed off, fuming. At the moment, her entire martial arts robes were completely wet, revealing her figure. Naturally, she could not stay there any longer, lest she continue giving everyone a free show.

source: 翊小姐满脸可惜的说道：“下次他要是再来，一定要第一时间让人通知我，那个陪练好厉害，我的暴雨拳修炼了八年，这三年一直卡在精通阶段，和他对练了一场竟大成了……”
en_us: With a look of pity on her face, Young Mistress Yi replied, "You must get someone to inform me in the first instance the next time he returns. That sparring partner is really powerful. I have been practising my Thunderstorm Fist for eight years and have been stuck at the 'Proficiency' stage for the past three years. Yet, once I've sparred with him in a single practice match, I actually managed to reach the 'Phenomenal' stage..."

source: 翊飞儿一听脸色更臭了，一跺脚道：“你不会还手啊？这样陪练有什么意思？”
en_us: Yi Fei-er scowled harder at this and stomped her foot, "Why don't you fight back then? Where's the fun in sparring when you are like this?"

source: 翊飞儿差点摔倒，一张俏脸上都是恼羞成怒之色，站稳身子之后立即反手又攻击而来，结局很悲剧，她一次次被江逸抓住手，如耍猴般围绕着江逸冲来冲去……
en_us: Yi Fei-er almost fell, her face was red with embarrassment and anger. She steadied herself and immediately resumed her attack. Sadly, the result was the same, and she turned out to be the one who was like a monkey that was being provoked by Jiang Yi, dashing around in the room...

source: 翊飞儿战力明显比翊凌雪差远了，江逸轻松从漫天的拳影中抓住一双滑腻的白手，他也不敢用力，抓住她的手后顺势朝旁边轻轻一带，翊飞儿的身躯就朝那边跌跌撞撞而去。
en_us: Yi Fei-er's fighting skills were obviously far below that of Yi Lingxue. Effortlessly, Jiang Yi caught a pair of silky smooth hands amid the flying fist silhouettes. He dared not exert too much force and lightly yanked her sideways. That was all it took for Yi Fei-er to stumble over.
